In [2]:
import sys
sys.path.append('/home/ranvir/AiCore')
from database_connection import DatabaseConnection
db = DatabaseConnection()

# Basic Aggregation

## 1. How many rented films do not have a return date?

In [5]:
db.execute_query('''
                    SELECT COUNT(*) AS rented_films_without_return_date
                    FROM rental
                    WHERE return_date IS NULL;
                ''')

   rented_films_without_return_date
0                               183

## 2. What is the total amount of payments that the business has received?

In [6]:
db.execute_query('''
                    SELECT COUNT(*)
                    FROM payment
                    WHERE amount IS NOT NULL;
                ''')

   count
0  16049

## 3. What is the total amount of payments that the business has received between the dates 25/01/2007 and 29/01/2007

In [8]:
db.execute_query('''
                    SELECT COUNT(*) AS between_01_25_to_01_29
                    FROM payment
                    WHERE payment_date BETWEEN '2007-01-25'::TIMESTAMP AND '2007-01-29'::TIMESTAMP;
                ''')

   between_01_25_to_01_29
0                     672

## 4. When was the earliest transaction made?

In [10]:
db.execute_query('''
                        SELECT
                                        MIN(payment_date)
                        FROM payment;
                ''')

                         min
0 2007-01-24 21:21:56.996577

## 5. When was the last transaction over $10 made?

In [11]:
db.execute_query('''
                    SELECT
                            MAX(payment_date)
                    FROM payment
                    WHERE amount > 10;
                ''')

                         max
0 2007-04-30 21:58:17.996577

## 6. What is the price of the highest value film the business has?

In [12]:
db.execute_query('''
                    SELECT
                            MAX(rental_rate) AS highest_price
                    FROM film;
                ''')

   highest_price
0           4.99

## 7. What is the average length of films?

In [13]:
db.execute_query('''
                    SELECT
                            AVG(length)
                    FROM film;
                ''')

       avg
0  115.272

## 8. What is the average length of films who's rental cost is under $2.99

In [15]:
db.execute_query('''
                    SELECT
                            AVG(length)
                    FROM film
                    WHERE rental_rate < 2.99;
                ''')

          avg
0  112.912023